app/interactors/buscar_promocoes_milhas.rb

  def call
    site_id = context.site_id
    site = Site.find(site_id)
---
SELECT "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]