app/controllers/clientes_controller.rb

  def index
    @clientes = Cliente.order(:nome)
---
SELECT "clientes".* FROM "clientes" ORDER BY "clientes"."nome" ASC

  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
      if @cliente.save
---
INSERT INTO "clientes" ("nome", "observacao", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nome", "Sweet Hair"], ["observacao", ""], ["created_at", "2020-11-02 11:34:22.236849"], ["updated_at", "2020-11-02 11:34:22.236849"]]