app/controllers/empresas_controller.rb

  def index
    @empresas = Empresa.order(:nome)
---
SELECT "empresas".* FROM "empresas" ORDER BY "empresas"."nome" ASC

  def create
    @empresa = Empresa.new(empresa_params)

    respond_to do |format|
      if @empresa.save
---
INSERT INTO "empresas" ("nome", "observacao", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nome", "Azul"], ["observacao", ""], ["created_at", "2020-11-02 13:50:25.052731"], ["updated_at", "2020-11-02 13:50:25.052731"]]

  def set_empresa
    @empresa = Empresa.find(params[:id])
---
SELECT "empresas".* FROM "empresas" WHERE "empresas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]