app/controllers/promocoes_controller.rb

SELECT "sites"."id", "sites"."nome" FROM "sites" ORDER BY "sites"."nome" ASC
SELECT "sites".* FROM "sites" ORDER BY "sites"."nome" ASC
---
  def index
    @sites = Site.order(:nome).map { |objeto| [objeto.nome, objeto.id] }
    params[:sites] = @sites[0][1] unless params[:sites].present?