app/controllers/sites_controller.rb

  def index
    @sites = Site.order(:nome)
---
SELECT "sites".* FROM "sites" ORDER BY "sites"."nome" ASC

  def create
    @site = Site.new(site_params)

    respond_to do |format|
      if @site.save
---
INSERT INTO "sites" ("nome", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nome", "Livelo"], ["url", "https://www.livelo.com.br/ganhe-pontos-compre-e-pontue"], ["created_at", "2020-10-24 11:35:42.891978"], ["updated_at", "2020-10-24 11:35:42.891978"]]

  def update
    respond_to do |format|
      if @site.update(site_params)
---
UPDATE "sites" SET "url" = $1, "codigo" = $2, "updated_at" = $3 WHERE "sites"."id" = $4  [["url", "https://www.shoppingsmiles.com.br/smiles/super_busca.jsf?b="], ["codigo", "iphone+xr"], ["updated_at", "2020-11-01 12:06:35.027113"], ["id", 2]]

  def set_site
    @site = Site.find(params[:id])
---
SELECT "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]