app/controllers/tipo_pagamentos_controller.rb

SELECT "tipo_pagamentos".* FROM "tipo_pagamentos" ORDER BY "tipo_pagamentos"."nome" ASC
---
  def index
    @tipo_pagamentos = TipoPagamento.order(:nome)

INSERT INTO "tipo_pagamentos" ("nome", "observacao", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nome", "Porto Seguro - Fernando"], ["observacao", ""], ["created_at", "2020-11-02 13:04:56.472270"], ["updated_at", "2020-11-02 13:04:56.472270"]]
---
  def create
    @tipo_pagamento = TipoPagamento.new(tipo_pagamento_params)

    respond_to do |format|
      if @tipo_pagamento.save

UPDATE "tipo_pagamentos" SET "nome" = $1, "updated_at" = $2 WHERE "tipo_pagamentos"."id" = $3  [["nome", "Dinheiro - Fernando"], ["updated_at", "2020-11-02 13:13:53.641441"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @tipo_pagamento.update(tipo_pagamento_params)

SELECT "tipo_pagamentos".* FROM "tipo_pagamentos" WHERE "tipo_pagamentos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_tipo_pagamento
    @tipo_pagamento = TipoPagamento.find(params[:id])