app/controllers/vendas_controller.rb

SELECT "vendas".* FROM "vendas"
---
  def index
    @vendas = Venda.all

INSERT INTO "vendas" ("data_venda", "cliente_id", "tipo_venda_id", "data_utilizacao", "empresa_id", "tipo_pagamento_id", "localizador", "viajante_id", "forma_pagamento_id", "qtd_parcelas", "custo", "venda", "lucro", "lucro_porcentagem", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
---
  def create
    @venda = Venda.new(venda_params)

    respond_to do |format|
      if @venda.save

UPDATE "vendas" SET "venda" = $1, "lucro" = $2, "updated_at" = $3 WHERE "vendas"."id" = $4  [["venda", "150.0"], ["lucro", "252.0"], ["updated_at", "2020-11-02 20:51:54.363918"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @venda.update(venda_params)

SELECT "vendas".* FROM "vendas" WHERE "vendas"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def set_venda
    @venda = Venda.find(params[:id])