app/controllers/viajantes_controller.rb

  def index
    @viajantes = Viajante.order(:nome)
---
SELECT "viajantes".* FROM "viajantes" ORDER BY "viajantes"."nome" ASC

  def create
    @viajante = Viajante.new(viajante_params)

    respond_to do |format|
      if @viajante.save
---
INSERT INTO "viajantes" ("nome", "rg", "cpf", "data_nascimento", "passaporte", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    respond_to do |format|
      if @viajante.update(viajante_params)
---
UPDATE "viajantes" SET "cpf" = $1, "updated_at" = $2 WHERE "viajantes"."id" = $3  [["cpf", "945.359.811-91"], ["updated_at", "2020-11-02 12:22:06.324998"], ["id", 1]]

  def set_viajante
    @viajante = Viajante.find(params[:id])
---
SELECT "viajantes".* FROM "viajantes" WHERE "viajantes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]