app/views/vendas/_form.html.erb

SELECT "clientes"."id", "clientes"."nome" FROM "clientes" ORDER BY "clientes"."nome" ASC
---
  <%= form.label :cliente_id %>
  <%= form.select(:cliente_id, @clientes.map{|cliente| [cliente.nome,cliente.id]}, selected: venda.cliente_id) %>

SELECT "empresas"."id", "empresas"."nome" FROM "empresas" ORDER BY "empresas"."nome" ASC
---
  <%= form.label :empresa_id %>
  <%= form.select(:empresa_id, @empresas.map{|empresa| [empresa.nome,empresa.id]}, selected: venda.empresa_id) %>

SELECT "tipo_pagamentos"."id", "tipo_pagamentos"."nome" FROM "tipo_pagamentos" ORDER BY "tipo_pagamentos"."nome" ASC
---
  <%= form.label :tipo_pagamento_id %>
  <%= form.select(:tipo_pagamento_id, @tipos_pagamento.map{|tipo| [tipo.nome,tipo.id]}, selected: venda.tipo_pagamento_id) %>

SELECT "viajantes"."id", "viajantes"."nome" FROM "viajantes" ORDER BY "viajantes"."nome" ASC
---
  <%= form.label :viajante_id %>
  <%= form.select(:viajante_id, @viajantes.map{|viajante| [viajante.nome,viajante.id]}, selected: venda.viajante_id) %>